Execution result of `show -no-color plan.out` in `infra/live/azure/linux-public/` :
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.self will be updated in-place
  ~ resource "azurerm_container_registry" "self" {
        id                            = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerRegistry/registries/sk8simgs"
        name                          = "sk8simgs"
      ~ public_network_access_enabled = true -> false
        tags                          = {}
        # (15 unchanged attributes hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.self will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "self" {
        id                                  = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerService/managedClusters/sk8s"
        name                                = "sk8s"
        tags                                = {}
        # (27 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "hot"
          ~ tags                         = {
              + "owner"   = "GitHub Practice"
              + "project" = "Sk8s"
            }
            # (23 unchanged attributes hidden)
        }

      + oms_agent {
          + log_analytics_workspace_id = (known after apply)
          + oms_agent_identity         = (known after apply)
        }

        # (6 unchanged blocks hidden)
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.self["win"] will be destroyed
  # (because key ["win"] is not in for_each map)
  - resource "azurerm_kubernetes_cluster_node_pool" "self" {
      - custom_ca_trust_enabled = false -> null
      - enable_auto_scaling     = true -> null
      - enable_host_encryption  = false -> null
      - enable_node_public_ip   = false -> null
      - fips_enabled            = false -> null
      - id                      = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerService/managedClusters/sk8s/agentPools/win" -> null
      - kubelet_disk_type       = "OS" -> null
      - kubernetes_cluster_id   = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerService/managedClusters/sk8s" -> null
      - max_count               = 3 -> null
      - max_pods                = 30 -> null
      - min_count               = 1 -> null
      - mode                    = "User" -> null
      - name                    = "win" -> null
      - node_count              = 1 -> null
      - node_labels             = {} -> null
      - node_taints             = [] -> null
      - orchestrator_version    = "1.25.11" -> null
      - os_disk_size_gb         = 128 -> null
      - os_disk_type            = "Managed" -> null
      - os_sku                  = "Windows2022" -> null
      - os_type                 = "Windows" -> null
      - priority                = "Regular" -> null
      - scale_down_mode         = "Delete" -> null
      - spot_max_price          = -1 -> null
      - tags                    = {} -> null
      - ultra_ssd_enabled       = false -> null
      - vm_size                 = "Standard_D2s_v3" -> null
      - vnet_subnet_id          = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.Network/virtualNetworks/sk8s-cluster-vnet/subnets/nodes" -> null
      - zones                   = [
          - "1",
          - "2",
          - "3",
        ] -> null
    }

  # module.aks.azurerm_log_analytics_solution.self[0] will be created
  + resource "azurerm_log_analytics_solution" "self" {
      + id                    = (known after apply)
      + location              = "eastus"
      + resource_group_name   = "sk8s-cluster"
      + solution_name         = "ContainerInsights"
      + tags                  = {
          + "owner"   = "GitHub Practice"
          + "project" = "Sk8s"
        }
      + workspace_name        = "sk8s-cluster-logs"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.aks.azurerm_log_analytics_workspace.self[0] will be created
  + resource "azurerm_log_analytics_workspace" "self" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "eastus"
      + name                               = "sk8s-cluster-logs"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "sk8s-cluster"
      + retention_in_days                  = (known after apply)
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "owner"   = "GitHub Practice"
          + "project" = "Sk8s"
        }
      + workspace_id                       = (known after apply)
    }

  # module.aks.azurerm_monitor_diagnostic_setting.self[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "self" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "AKS Control Plane Logging"
      + target_resource_id             = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.ContainerService/managedClusters/sk8s"

      + enabled_log {
          + category = "cloud-controller-manager"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "cluster-autoscaler"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "csi-azuredisk-controller"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "csi-azurefile-controller"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "csi-snapshot-controller"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "kube-apiserver"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "kube-controller-manager"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "kube-scheduler"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }

  # module.network.azurerm_subnet.self[1] will be updated in-place
  ~ resource "azurerm_subnet" "self" {
        id                                             = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.Network/virtualNetworks/sk8s-cluster-vnet/subnets/aci"
        name                                           = "aci"
        # (9 unchanged attributes hidden)

      - delegation {
          - name = "aciDelegation" -> null

          - service_delegation {
              - actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/action",
                ] -> null
              - name    = "Microsoft.ContainerInstance/containerGroups" -> null
            }
        }
    }

  # module.network.azurerm_subnet_network_security_group_association.self[1] will be created
  + resource "azurerm_subnet_network_security_group_association" "self" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.Network/networkSecurityGroups/sk8s-cluster-vnet-nsg"
      + subnet_id                 = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/sk8s-cluster/providers/Microsoft.Network/virtualNetworks/sk8s-cluster-vnet/subnets/aci"
    }

Plan: 4 to add, 3 to change, 1 to destroy.
```
    